dataset_gen/Reynolds_Variation/FPO_cylinder/Multiple_Hole_easy/Design_Point_0/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            fixedValue;
        value           nonuniform List<vector>
        (
            (0.0 0.0 0.0)  // Placeholder, script will insert computed values
        );
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    hole
    {
        type            fixedValue;
        value           uniform (0 0 0);  // No-slip condition at the hole
    }
    frontAndBack
    {
        type            empty;
    }
}
